benchmarks/results/2026-07-14_php-fpm/raw/laravel_getip_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.30.3
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getip?format=json
Document Length:        279 bytes

Concurrency Level:      50
Time taken for tests:   5.412 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3705000 bytes
HTML transferred:       1395000 bytes
Requests per second:    923.96 [#/sec] (mean)
Time per request:       54.115 [ms] (mean)
Time per request:       1.082 [ms] (mean, across all concurrent requests)
Transfer rate:          668.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     3   53  34.8     70      94
Waiting:        2   53  34.8     70      94
Total:          3   54  34.8     70      94

Percentage of the requests served within a certain time (ms)
  50%     70
  66%     88
  75%     88
  80%     89
  90%     89
  95%     90
  98%     90
  99%     91
 100%     94 (longest request)