benchmarks/results/2026-07-14_php-fpm/raw/laravel_getuuid_3.txt
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        nginx/1.30.3
Server Hostname:        127.0.0.1
Server Port:            18080

Document Path:          /getuuid?version=7
Document Length:        72 bytes

Concurrency Level:      50
Time taken for tests:   5.512 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3650000 bytes
HTML transferred:       360000 bytes
Requests per second:    907.14 [#/sec] (mean)
Time per request:       55.118 [ms] (mean)
Time per request:       1.102 [ms] (mean, across all concurrent requests)
Transfer rate:          646.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2   55  35.2     72      95
Waiting:        2   55  35.2     71      95
Total:          3   55  35.2     72      95

Percentage of the requests served within a certain time (ms)
  50%     72
  66%     88
  75%     89
  80%     89
  90%     90
  95%     90
  98%     91
  99%     91
 100%     95 (longest request)